Repository: skornel02/duszamobile2020
Catalog: lib/l10n/intl_*.arb
Languages: hu

# title
source: Dusza mobile 2020
hu: Dusza mobil 2020

source: Cheese
hu: Sajt

source: Main page
hu: Főoldal

# welcome
source: Welcome {name}!
hu: Üdvözlünk {name}!

source: Export
hu: Exportálás

source: Add
hu: Hozzáadás

source: Yes
hu: Igen

source: No
hu: Nem

source: User settings
hu: Felhasználói beállítások

source: Google login
hu: Google belépés

# synchronise
source: Synchronize
hu: Szinkronizáció

source: Calendar synchronisation
hu: Naptár szinkronizáció

source: Dark theme
hu: Sötét mód

source: Price
hu: Ár

source: Language
hu: Nyelv

source: Last refuel was recorded
hu: Utolsó tankolás rögzítve

# liter_price
source: Liter price: {price} $
hu: Liter ár: {price} Ft

# consumption
source: Efficiency: {efficiency} l/100km
hu: Hatékonyság: {efficiency} l/100km

# spending_format
source: {item}: {amount} $
hu: {item}: {amount} Ft

source: Type
hu: Típus

source: Regional
hu: Megyei

source: Region
hu: Megye

source: Weekly
hu: Heti

source: Monthly
hu: Havi

source: Yearly countrywide
hu: Éves országos

# yearly_regional
source: Weekly
hu: Éves megyei

source: Other regions
hu: Más megyék

source: More regions
hu: Több megye

source: Bought
hu: Megvett

source: Name
hu: Név

source: Description
hu: Leírás

source: Year
hu: Év

source: Edit car
hu: Autó szerkesztése

source: Save
hu: Mentés

source: Edit
hu: Szerkesztés

# tire_type
source: Tyre type
hu: Abroncs típus

# tire_type_winter
source: Winter
hu: Téli

# tire_type_summer
source: Summer
hu: Nyári

# tire_type_all_year
source: All year
hu: Egész éves

# tire_type_other
source: Other
hu: Egyéb

source: Statistics
hu: Statisztikák

source: Refuels
hu: Tankolások

source: Reminders
hu: Értesítések

source: EVignettes
hu: Autópálya matricák

source: Repairs
hu: Szervizelések

source: Change car
hu: Autó váltás

source: Add refuel
hu: Tankolás hozzáadása

source: Add reminder
hu: Értesítés hozzáadása

source: Add eVignette
hu: Autópálya matrica hozzáadása

source: Add repair
hu: Szervizelés hozzáadása

source: Edit reminder
hu: Értesítés szerkesztése

source: Edit refuel
hu: Tankolás szerkesztése

source: Edit repair
hu: Szervizelés szerkesztése

source: My cars
hu: Autóim

source: Add car
hu: Autó hozzáadása

source: Car settings
hu: Autó beállítások

source: Car name
hu: Autó név

# milage
source: Current milage
hu: Kilométer óra állása

# last_milage
source: Last refuel milage
hu: Kilométer óra állása legutóbbi tankolásnál

source: After milage
hu: Kilométer után

# cant_be_empty
source: {item} can't be empty!
hu: {item} nem lehet üres!

# cant_be_over
source: {item} can't be over {amount} of characters
hu: {item} nem lehet több, mint {amount} karakter

# cant_be_not_int
source: {item} must be a valid integer
hu: {item} csak érvényes szám lehet

# cant_be_not_double
source: {item} must be a valid number
hu: {item} csak érvényes szám lehet

# cant_be_invalid_date
source: {item} must have a valid date
hu: {item} csak érvényes dátum lehet

# cant_be_smaller
source: {item} must be bigger than {otherItem}
hu: {item} nagyobbnak kell lennie, mint {otherItem}

# cant_be_before
source: {targetDate} must be after {date}
hu: {targetDate}-nak/nek {date} után kell lennie

source: Create
hu: Létrehozás

# time_format
source: yyyy-MM-dd â€“ kk:mm
hu: éééé-HH-nn – kk:mm

# last_change
source: Last {area} change: {time}
hu: Utolsó {area} változás: {time}

# local_area
source: local
hu: helyi

# remote_area
source: remote
hu: távoli

source: Are you sure?
hu: Biztos vagy benne?

# do_you_want_to
source: You dou want to {do_something}?
hu: Szeretnéd elvégezni: {do_something}?

# do_remove_car
source: remove car '{car_name}'
hu: autó törlése '{car_name}'

# do_remove_repair
source: remove repair log at {date}
hu: szervizelés törlése ekkor: {date}

# do_remove_refuel
source: remove refuel log at {date}
hu: tankolás törlése ekkor: {date}

# do_remove_reminder
source: remove reminder with title '{title}'
hu: emlékeztető törlése: '{title}'

# do_remove_e_vignette
source: remove E-Vignette valid from {date}
hu: ettől érvéney autópálya matrica törlése {date}

# date_format
source: dd-MM-yyyy
hu: nn-HH-éééé

# date_format_to_show
source: yyyy.MM.dd
hu: éééé.HH.nn

# notification_date
source: Your reminder set for {date} has expired! {title}
hu: Az emlékeztető ezen a dátumon {date} lejárt! {title}

# notification_milage
source: Your milage goal {milage} is over! {title}
hu: Elérted a kilométer {milage} célodat! {title}

# notification_date_and_milage
source: Check your reminder: {title}
hu: Nézd meg az emlékeztetőd: {title}

source: Date
hu: Dátum

source: Notify on date
hu: Emlékeztető ekkor

source: Notify after kilometers
hu: Emlékeztető ennyi kilométer után

source: Reason
hu: Ok

# warranty
source: Under warranty
hu: Garanciális

# refuels_page_title
source: Refuels - {carName}
hu: Tankolások - {carName}

# refuels_page_menuitem
source: Refuels
hu: Tankolások

# consumption_label
source: Consumption in liter/100km
hu: 100 kilométerenkénti fogyasztás literben

# repairs_page_menuitem
source: Repairs
hu: Szervizek

# reminders_page_menuitem
source: Reminders
hu: Értesitők

# e_vignette_page_menuitem
source: E-Vignettes
hu: Autópálya matricák

# statistics_page_menuitem
source: Statistics
hu: Statisztikák

# car_settings_page_menuitem
source: Car settings
hu: Autó beállítások

# user_settings_page_menuitem
source: User/App settings
hu: Felhasználói beállitás

# back_to_cars_menuitem
source: Choose different car
hu: Másik autó választása

# currency
source: {efficiency} $
hu: {efficiency} Ft

# expiration_date
source: Valid until {date}
hu: Érvényes eddig: {date}

source: Expiration
hu: Lejárat

# expiration_weekly
source: Weekly
hu: Heti

# expiration_monthly
source: Monthly
hu: Havi

# expiration_yearly
source: Annual
hu: Éves

# only_annual_for_county
source: Only country wide available
hu: Csak országos elérhető

source: County
hu: Megye

source: Cancel
hu: Mégse

source: Active
hu: Aktív

source: Expired
hu: Lejárt

source: Upcoming
hu: Közelgő

source: Suggestion
hu: Ajánlás

# remind_about_e_vignette
source: Do you want to create a reminder when the E-Vignette expires?
hu: Szeretnél emlékeztetőt létrehoznyi, amikor az autpálya matrica lejár?

# e_vignette_expiration_reminder
source: [E-Vignette] {area} will expire
hu: [E-Vignette] {area} le fog járni

source: Automatically generated
hu: Automatikusan generált

# complete_reminder
source: Are you sure you want to complete '{name}'?
hu: Biztosan teljesíteni szeretnéd: '{name}'?

# repeat_this_reminder_again
source: Do you want to repeat this reminder?
hu: Meg akarod ismételni ezt az emlékeztetőt?

source: Both
hu: Mindkettő

source: Refuel
hu: tankolás

# settings_description
source: Everything from syncing to the cloud to dark mode can be accessed here. Mash some buttons and see what happens!
hu: Itt érhető el a felhőbe való szinkronizálástól kezdve a sötét módig minden. Bökj meg pár gombot és nézd mi történik!

# empty
source: No {s} added yet
hu: Nincs még {s} hozzáadva

source: Total spending
hu: Összes költség

# petrol_price_over_time
source: Petrol price change
hu: Üzemanyag árváltozás

source: Filter
hu: Szűrő

source: General statistics
hu: Általános statisztikák

# days_left
source: {day} days left
hu: {day} nap maradt

# km_left
source: after {km} km
hu: {km} km maradt

source: Test notification
hu: Teszt értesítés

# export_json
source: My JSON export
hu: A JSON exportom
